

{
  "posts": [
    {
    "id": "1",
    "title": "Why Learning to Code Changed my Life",
    "content": "I used to feel stuck in a job that didn’t challenge or excite me. Then I discovered programming. At first, it was confusing and intimidating, but over time, I learned to love the logic and creativity of coding. Now, I build applications, solve real-world problems, and collaborate with amazing teams. Learning to code didn’t just change my job—it changed how I think and approach challenges.",
    "author": "Amina Yusuf",
    "imageUrl": "https://images.unsplash.com/photo-1515378791036-0648a3ef77b2",
    "description": "From zero to tech hero — how coding transformed Amina’s life and career."
  },
  {
    "id": "2",
    "title": "Remote Work: Productivity Hacks That Actually Work",
    "content": "Working from home sounds like a dream—until distractions, burnout, and isolation kick in. After months of trial and error, I’ve found a set of hacks that truly work: setting a consistent schedule, using the Pomodoro technique, prioritizing tasks with the Eisenhower Matrix, and taking regular screen-free breaks. These strategies have boosted my focus and well-being, making remote work sustainable and rewarding.",
    "author": "Daniel Cho",
    "imageUrl": "https://images.unsplash.com/photo-1557804506-669a67965ba0",
    "description": "Master your day from your desk — real hacks for remote work success."
  },
  {
    "id": "3",
    "title": "Designing for Accessibility: A Beginner's Guide",
    "content": "Accessibility in design isn’t just a bonus—it’s a necessity. Creating digital experiences that work for everyone, including people with disabilities, ensures inclusion and usability. This guide covers key principles: color contrast, keyboard navigation, alt text, semantic HTML, and screen reader compatibility. Whether you're a beginner or seasoned designer, accessibility should always be part of your design process.",
    "author": "Rachel Lin",
    "imageUrl": "https://images.unsplash.com/photo-1472214103451-9374bd1c798e",
    "description": "Design with purpose — create digital spaces everyone can access and love."
  },
    {
      "id": "4",
      "title": "Why Learning to Code Changed my life",
      "content": "Blog!",
      "author": "Amina Yusuf",
      "imageUrl": "https://images.unsplash.com/photo-1515378791036-0648a3ef77b2",
      "description": "Amina shares her personal journey from confusion to confidence through learning programming."
    },
    {
      "id": "5",
      "title": "Remote Work: Productivity Hacks That Actually Work",
      "content": "Blog!",
      "author": "Daniel Cho",
      "imageUrl": "https://images.unsplash.com/photo-1557804506-669a67965ba0",
      "description": "Practical, tried-and-true strategies to stay productive while working from home."
    },
    {
      "id": "6",
      "title": "Designing for Accessibility: A Beginner's Guide",
      "content": "Blog!",
      "author": "Rachel Lin",
      "imageUrl": "https://images.unsplash.com/photo-1472214103451-9374bd1c798e",
      "description": "Learn the basics of creating inclusive designs that everyone can use and enjoy."
    },
    {
       "id": "7",
    "title": "5 Morning Habits That Boost Productivity",
    "author": "Jane Doe",
    "description": "Start your day right with these proven habits to improve focus and energy.",
    "content": "Waking up early, planning your day, exercising, eating a healthy breakfast, and meditating are five simple but powerful habits that can drastically improve your productivity. Incorporate them into your morning routine and see the difference over time.",
    "imageUrl": "https://images.unsplash.com/photo-1507525428034-b723cf961d3e"
  },
  {
     "id": "8",
    "title": "The Ultimate Guide to Minimalist Living",
    "author": "John Smith",
    "description": "Discover how living with less can bring more clarity, peace, and purpose.",
    "content": "Minimalist living is about intentionally choosing what adds value to your life and letting go of the rest. From decluttering your space to simplifying your schedule, this guide walks you through practical steps to embrace minimalism without feeling deprived.",
    "imageUrl": "https://images.unsplash.com/photo-1507525428034-b723cf961d3e"
  },
  {
     "id": "9",
    "title": "Top 10 Travel Destinations for 2025",
    "author": "Emily Johnson",
    "description": "Explore the most breathtaking travel spots to add to your bucket list this year.",
    "content": "Whether you're into beaches, mountains, or vibrant cities, 2025 offers exciting destinations for every traveler. From Kyoto’s serene temples to Iceland’s dramatic landscapes, discover where to go and why these places stand out.",
    "imageUrl": "https://images.unsplash.com/photo-1507525428034-b723cf961d3e"
  }
  ]
}

